espressif/esp-idf/examples/ethernet/iperf/sdkconfig.ci.psram_ip101_esp32p4
# Common / performance options live in sdkconfig.defaults

CONFIG_IDF_TARGET="esp32p4"

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

# Config Ethernet Init
CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_PHY_IP101=y
CONFIG_ETHERNET_PHY_INTERFACE_RMII=y
CONFIG_ETHERNET_MDC_GPIO=31
CONFIG_ETHERNET_MDIO_GPIO=52
CONFIG_ETHERNET_PHY_RST_GPIO=51
CONFIG_ETHERNET_PHY_ADDR=1

# Allocate EMAC buffers in PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y # to able to derive RMII CLKs
CONFIG_ETH_DMA_USE_PSRAM=y
